---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Scale
source: html/ad6a309e-7d5b-1f2c-fa0d-23eeff4ca7a7.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Scale Property

Multiplier used for displaying diagram or vector values in view.

## Syntax (C#)
```csharp
public double Scale { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: scale is zero or negative